In [1]:
import pandas as pd

## Read csv files

In [4]:
slcsp_df = pd.read_csv("slcsp.csv")

In [5]:
zips_df = pd.read_csv("zips.csv")

In [7]:
plans_df = pd.read_csv("plans.csv")

## Iterate through df

In [9]:
slcsp_df.head()

   zipcode  rate
0    64148   NaN
1    67118   NaN
2    40813   NaN
3    18229   NaN
4    51012   NaN

In [12]:
for idx in slcsp_df.head().index:
    print(slcsp_df['zipcode'][idx])

64148
67118
40813
18229
51012

In [80]:
zipcode = slcsp_df['zipcode'][0]

ziprow = zips_df[zips_df.zipcode==zipcode][['zipcode','state', 'rate_area']]
ziprow

       zipcode state  rate_area
24911    64148    MO          3

In [78]:
ziprow['state'].values

array(['MO'], dtype=object)

In [75]:
zips_df[zips_df.zipcode==zipcode]

       zipcode state  county_code     name  rate_area
24911    64148    MO        29095  Jackson          3

In [56]:
ziprow[0][3]

'Jackson'

In [22]:
plans_df.head()

          plan_id state metal_level    rate  rate_area
0  74449NR9870320    GA      Silver  298.62          7
1  26325VH2723968    FL      Silver  421.43         60
2  09846WB8636633    IL        Gold  361.69          5
3  78590JQ3204809    SC        Gold  379.97          2
4  21163YD2193896    AR        Gold  359.75          2

In [58]:
rates_df = plans_df[(plans_df.state == ziprow[0][1]) & (plans_df.metal_level == 'Silver') &  (plans_df.rate_area == ziprow[0][4])]
rates_df

              plan_id state metal_level    rate  rate_area
424    78421VV7272023    MO      Silver  290.05          3
975    35866RG6997149    MO      Silver  234.60          3
1396   28850TB6621800    MO      Silver  265.82          3
3727   53546TY7687603    MO      Silver  251.08          3
10033  26631YR3384683    MO      Silver  351.60          3
13352  03665WJ8941702    MO      Silver  312.06          3
13899  02345TB1383341    MO      Silver  245.20          3
14123  40205HK1927400    MO      Silver  265.25          3
16245  57237RP9645446    MO      Silver  253.65          3
18034  64618UJ3132146    MO      Silver  319.57          3
18915  43868JA2737085    MO      Silver  271.64          3
19085  44945VH6426537    MO      Silver  298.87          3
22209  39063JC7040427    MO      Silver  341.24          3

In [69]:
rates_df = rates_df.drop_duplicates(subset=['rate'])

In [73]:
rates_df.sort_values(by=['rate']).iloc[1]['rate']

245.2